04-wordpress-II.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Wordpress: Make your own website, Part 2</title>
<meta name="author" content="(Matt Price)"/>
<link rel="stylesheet" href="./vendor/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./vendor/reveal.js/css/theme/matt.css" id="theme"/>

<link rel="stylesheet" href="file:///home/matt/src/org-reveal/local.css"/>
<link rel="stylesheet" href="./vendor/reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Wordpress: Make your own website, Part 2</h1><h2 class="author">Matt Price</h2><p class="date">Created: 2018-05-06 Sun 01:02</p>
</section>

<section>
<section id="slide-orga6fa826">
<h2 id="orga6fa826">Adding Links, Headers, and Lists</h2>
<div class="outline-text-2" id="text-orga6fa826">
</div></section>
<section id="slide-orgf71d714">
<h3 id="orgf71d714">What is a link?</h3>
<div class="org-src-container">

<pre><code class="html" ><a href="https://google.com">Link to Google</a>
</code></pre>
</div>
<p>
<a href="https://google.com">Link to Google</a>
</p>

<p>
Two parts:
</p>
<form><ul>
<li>&ldquo;target&rdquo;</li>
<li>displayed text</li>

</ul></form>
</section>
<section id="slide-org8467ce1">
<h3 id="org8467ce1">Headers</h3>
<form><ul>
<li>used to create an outline for your page</li>
<li>better to use headers than bold, italics,etc.</li>

</ul></form>
<h1> Top Level Header</h1>
<h3> Smaller Header</h1>
<h6> Tiny Header</h6>
</section>
<section id="slide-org3a53a52">
<h3 id="org3a53a52">Lists</h3>
<p>
We often use lists on the web. For instance, here are the steps to sign up for Wordpress:
</p>
<form><ul>
<li>Go to <a href="https://wordpress.com">Wordpress.com</a></li>
<li>Click on the <code>Register</code> link</li>
<li>Make sure you have spelled your email address correctly!</li>

</ul></form>
</section>
</section>
<section>
<section id="slide-org510ad87">
<h2 id="org510ad87">Images and PDFs</h2>
<form><ul>
<li>an image is a special kind of link</li>
<li>they are very important for yur website!</li>
<li>loading images takes a lot of Internet!
<form><ul>
<li>use the smallest side image that is still good quality</li>

</ul></form></li>

</ul></form>
</section>
<section id="slide-org0602a3d">
<h3 id="org0602a3d">Media Library</h3>
<form><ul>
<li>In Wordpress, you can show images that are stored Wordpress or somewhere else.</li>
<li>For <b>&ldquo;external&rdquo;</b> images, you need to get the link from your browser</li>
<li><b>&ldquo;Local&rdquo;</b> images are stored in the &ldquo;Media Library&rdquo;</li>
<li>Documents are also stored there.</li>
<li>Use the &ldquo;Add Media&rdquo; button to insert a picture into your page.</li>
<li>Do the same for PDF documents</li>

</ul></form>
</section>
<section id="slide-org226f3aa">
<h3 id="org226f3aa">Inserting into pages</h3>
<form><ul>
<li>use the &ldquo;Add Media&rdquo; button to insert into pages</li>
<li>with images, you can select many pictures to make a &ldquo;gallery&rdquo; Try it and see howit works!</li>

</ul></form>
</section>
</section>
<section>
<section id="slide-orgff1e5ec">
<h2 id="orgff1e5ec">Themes</h2>
<form><ul>
<li>choose themes in &ldquo;theme Gallery&rdquo;</li>
<li><code>yoursite/wp-admin</code> &#x2013;&gt; Appearance &#x2013;&gt; Themes</li>
<li>use &ldquo;Customizer&rdquo; to change options</li>
<li>remember to select from the &ldquo;Free&rdquo; themes!</li>
<li>We like &ldquo;Franklin&rdquo; and &ldquo;Colinear&rdquo;</li>

</ul></form>
</section>
</section>
<section>
<section id="slide-org52787f3">
<h2 id="org52787f3">Widgets</h2>
<form><ul>
<li>Calendar is nice!</li>
<li>Google Translate (for Nepali)</li>
<li>Many others</li>
<li>Custom HTML for advanced use</li>

</ul></form>
</section>
</section>
</div>
</div>
<script src="./vendor/reveal.js/lib/js/head.min.js"></script>
<script src="./vendor/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: false,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
margin: 0.10,
maxScale: 1.00,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
{src: './vendor/reveal.js/plugin/klipse_reveal.js'},
 { src: './vendor/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './vendor/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './vendor/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './vendor/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: './vendor/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './vendor/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
